Autodesk.Revit.DB.Structure.RebarShapeConstraint.GetParamId
Return the Id of the parameter associated with this constraint.
Remarks:
Most subclasses of RebarShapeConstraint require a parameter.
Returns:
The Id of the parameter, or InvalidElementId if the constraint
does not have one.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraint.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarShapeConstraint
A dimension or other constraint that takes part in a RebarShapeDefinition.
Since:
2012